Revit 2026 API

# RebarCrankTypeUtilsSetCrankRatio Method

---

Sets the crank ratio value.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void SetCrankRatio(
	Document document,
	ElementId rebarCrankTypeId,
	double crankRatio
)
```
```vb
Public Shared Sub SetCrankRatio (
	document As Document,
	rebarCrankTypeId As ElementId,
	crankRatio As Double
)
```
```cpp
public:
static void SetCrankRatio(
	Document^ document,
	ElementId^ rebarCrankTypeId,
	double crankRatio
)
```
```fsharp
static member SetCrankRatio :
        document : Document *
        rebarCrankTypeId : ElementId *
        crankRatio : float -> unit
```

#### Parameters

document Document
     The document.
rebarCrankTypeId ElementId
     The Rebar Crank Type id.
crankRatio Double
     The crank ratio value.

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category. |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | The given value for crankRatio must be positive. |

The crank slope is 1/crankRatio.

#### Reference

RebarCrankTypeUtils Class

Autodesk.Revit.DB.Structure Namespace